<a href="https://colab.research.google.com/github/biamuniz/trabalhofinal_eda_mjda/blob/main/eda__projetofinal.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##<center>**Trabalho final: Análise Exploratória de Dados**</center>

Grupo: Bianca Muniz, Meyrele Torres e Ricardo Grimbaun

## **1. Sobre a base escolhida**
A base de dados escolhida é a de **microdados dos atletas e delegações presentes nas edições dos Jogos Olímpicos a partir de 1896**. Ela foi obtida no site do projeto [Base dos Dados](https://basedosdados.org/dataset/5b6db46a-4203-41ba-8c69-36b8653f5241), originalmente encontrada no [Kaggle](https://www.kaggle.com/heesoo37/olympic-history-data-a-thorough-analysis).

## **2. Análise exploratória univariada**
Variável escolhida: `idade`

In [29]:
# Importando as bibliotecas
import pandas as pd
import csv

In [44]:
# Carregando a base de dados
df = pd.read_csv(r'microdados.csv', sep=';')
print(df.describe())

                 ano      id_atleta  ...         altura           peso
count  269718.000000  269718.000000  ...  210917.000000  208204.000000
mean     1978.626862   68263.967381  ...     175.338953      70.699237
std        29.747764   39026.038321  ...      10.518507      14.348346
min      1896.000000       1.000000  ...     127.000000      25.000000
25%      1960.000000   34654.250000  ...     168.000000      60.000000
50%      1988.000000   68233.000000  ...     175.000000      70.000000
75%      2002.000000  102111.000000  ...     183.000000      79.000000
max      2016.000000  135571.000000  ...     226.000000     214.000000

[8 rows x 5 columns]

Note que a base a base tem dados tem aproximadamente 270 mil observações, mas este valor não é compatível com o número de registros de `altura`, de `peso` e de `idade`. Logo, isso mostra a presença de missing data.

Olhando a base, podemos ver que há nomes que se repetem na coluna nome_atleta, pois um mesmo atleta pode participar de diferentes modalidades de um mesmo esporte.

Para prosseguirmos com a análise da idade, limpamos a base no Excel com a finalidade de ter um registro por atleta em cada edição dos jogos, excluindo dessa maneira as colunas medalha e evento. Em seguida, removemos os valores duplicados. Salvamos o novo conjunto de dados com o nome microdados_limpo.csv, este com 189765 registros únicos.

Para a análise bivariada de medalhistas de ouro e idade, retiramos os valores duplicados no excel e salvamos a base como microdados_medalhas.csv

In [45]:
df.describe()

                 ano      id_atleta  ...         altura           peso
count  269718.000000  269718.000000  ...  210917.000000  208204.000000
mean     1978.626862   68263.967381  ...     175.338953      70.699237
std        29.747764   39026.038321  ...      10.518507      14.348346
min      1896.000000       1.000000  ...     127.000000      25.000000
25%      1960.000000   34654.250000  ...     168.000000      60.000000
50%      1988.000000   68233.000000  ...     175.000000      70.000000
75%      2002.000000  102111.000000  ...     183.000000      79.000000
max      2016.000000  135571.000000  ...     226.000000     214.000000

[8 rows x 5 columns]

In [31]:
df

         ano  edicao     cidade_sede  ...  peso       esporte   medalha
0       1896  Summer          Athina  ...   NaN        Tennis    Bronze
1       1896  Summer          Athina  ...   NaN       Cycling    Bronze
2       1896  Summer          Athina  ...   NaN      Shooting    Bronze
3       1896  Summer          Athina  ...   NaN       Fencing    Bronze
4       1896  Summer          Athina  ...   NaN      Shooting    Bronze
...      ...     ...             ...  ...   ...           ...       ...
200329  2016  Summer  Rio de Janeiro  ...  70.0       Sailing  No_medal
200330  2016  Summer  Rio de Janeiro  ...  50.0       Sailing  No_medal
200331  2016  Summer  Rio de Janeiro  ...  50.0  Table Tennis  No_medal
200332  2016  Summer  Rio de Janeiro  ...  54.0  Table Tennis  No_medal
200333  2016  Summer  Rio de Janeiro  ...  72.0     Athletics  No_medal

[200334 rows x 14 columns]

In [32]:
dados_limpo = pd.read_csv(r'microdados_limpo.csv', sep=';')
dados_medalhas = pd.read_csv(r'microdados_medalhas.csv', sep=';')

In [33]:
dados_limpo.select_dtypes(include=['number']) #incluindo um NaN nos dados ausentes
dados_medalhas.select_dtypes(include=['number'])#incluindo um NaN nos dados ausentes

         ano  id_atleta  idade  altura  peso
0       1896      35698   22.0     NaN   NaN
1       1896     107006   23.0     NaN   NaN
2       1896      54456   21.0     NaN   NaN
3       1896      85988   29.0     NaN   NaN
4       1896      85988   29.0     NaN   NaN
...      ...        ...    ...     ...   ...
200329  2016     132986   24.0   167.0  70.0
200330  2016     133071   21.0   156.0  50.0
200331  2016     133346   26.0   166.0  50.0
200332  2016     134826   22.0   168.0  54.0
200333  2016     120422   24.0   184.0  72.0

[200334 rows x 5 columns]

In [34]:
# Análise descritiva da variável idade
dados_limpo['idade'].describe()

count    182834.000000
mean         25.797220
std           6.104385
min          10.000000
25%          22.000000
50%          25.000000
75%          29.000000
max          97.000000
Name: idade, dtype: float64

## **3. Análise exploratória bivariada**
Variáveis escolhidas: `idade` e `sexo`; `idade` e `medalha de ouro`

### **3.1 Idade X sexo**

### Quantidade de registros, média, mediana, valores mínimo e máximo para cada sexo

In [35]:
# Estatísticas para o sexo feminino
feminino = dados_limpo["idade"].loc[dados_limpo['sexo'] == 'F']
feminino.describe()

count    48893.000000
mean        24.431902
std          5.611215
min         11.000000
25%         21.000000
50%         24.000000
75%         28.000000
max         74.000000
Name: idade, dtype: float64

In [36]:
# Estatísticas para o sexo masculino
masculino = dados_limpo["idade"].loc[dados_limpo['sexo'] == 'M']
masculino.describe()

count    133941.000000
mean         26.295608
std           6.200323
min          10.000000
25%          22.000000
50%          25.000000
75%          29.000000
max          97.000000
Name: idade, dtype: float64

In [37]:
# criando a tabela "est_idade_sexo", a partir de uma tabela dinâmica, comparando os resultados para os dois sexos
unused_columns = dados_limpo.columns.difference(set(['sexo']).union(set([])).union(set({'idade'})))
tmp_df = dados_limpo.drop(unused_columns, axis=1)
tab_dinamica_b = tmp_df.pivot_table(
    index=['sexo'],
    values=['idade'],
  aggfunc={'idade': ['mean', 'median', 'min', 'max', 'count']}) #media, mediana, valor mínimo e máximo para cada sexo
est_idade_sexo = tab_dinamica_b.reset_index()
print(est_idade_sexo)

  sexo   idade
         count   max       mean median   min
0    F   48893  74.0  24.431902   24.0  11.0
1    M  133941  97.0  26.295608   25.0  10.0

### Moda

In [38]:
# criando a tabela "contagem_sexo", a partir de uma tabela dinâmica
unused_columns = dados_limpo.columns.difference(set(['idade']).union(set(['sexo'])).union(set({'sexo'})))
tmp_df = dados_limpo.drop(unused_columns, axis=1)
tab_dinamica_a = tmp_df.pivot_table(
    index=['idade'],
    columns=['sexo'],
    values=['sexo'],
    aggfunc={'sexo': ['count']})  #### contar a quantidade de registros para cada sexo
contagem_sexo = tab_dinamica_a.reset_index()

In [39]:
print(contagem_sexo)

     idade   sexo
            count
sexo            F     M
0     10.0    NaN   1.0
1     11.0    9.0   1.0
2     12.0   21.0   6.0
3     13.0   75.0  25.0
4     14.0  282.0  61.0
..     ...    ...   ...
69    81.0    NaN   2.0
70    84.0    NaN   1.0
71    88.0    NaN   1.0
72    96.0    NaN   1.0
73    97.0    NaN   1.0

[74 rows x 3 columns]

In [40]:
# Qual a idade mais frequente entre competidores do sexo feminino nos jogos olímpicos?
moda_f = contagem_sexo.sort_values(by=('sexo', 'count', 'F'), ascending=False, na_position='last') #coloca os valores de count_f em ordem descendente. O primeiro valor em f é a moda
print(moda_f) #o primeiro valor é o valor mais frequente

     idade    sexo
             count
sexo             F        M
13    23.0  3758.0  11822.0
14    24.0  3749.0  11487.0
12    22.0  3747.0  10978.0
11    21.0  3628.0   9498.0
15    25.0  3550.0  10821.0
..     ...     ...      ...
69    81.0     NaN      2.0
70    84.0     NaN      1.0
71    88.0     NaN      1.0
72    96.0     NaN      1.0
73    97.0     NaN      1.0

[74 rows x 3 columns]

In [41]:
# Qual a idade mais frequente entre competidores do sexo masculina nos jogos olímpicos?
moda_m = contagem_sexo.sort_values(by=('sexo', 'count', 'M'), ascending=False, na_position='last')#coloca os valores de count_m em ordem descendente. O primeiro valor em m é a moda
print(moda_m) #o primeiro valor é o valor mais frequente

     idade    sexo
             count
sexo             F        M
13    23.0  3758.0  11822.0
14    24.0  3749.0  11487.0
12    22.0  3747.0  10978.0
15    25.0  3550.0  10821.0
16    26.0  3214.0   9883.0
..     ...     ...      ...
0     10.0     NaN      1.0
68    80.0     NaN      1.0
67    77.0     NaN      1.0
1     11.0     9.0      1.0
73    97.0     NaN      1.0

[74 rows x 3 columns]

### **3.2 Idade X Modalidade**

Analisamos também o perfil dos ganhadores das medalhas de ouro, usando a função .loc, que permite recortar linhas da tabela

In [42]:
ouro = dados_medalhas.loc[dados_medalhas['medalha'] == 'Gold']
ouro.describe()

                ano      id_atleta         idade       altura         peso
count  12228.000000   12228.000000  12094.000000  9625.000000  9388.000000
mean    1973.617926   69433.871933     25.999835   178.067221    74.626225
std       33.964288   39049.802106      5.846941    11.061828    15.327188
min     1896.000000       4.000000     13.000000   136.000000    28.000000
25%     1952.000000   36220.750000     22.000000   170.000000    64.000000
50%     1984.000000   69281.500000     25.000000   178.000000    74.000000
75%     2002.000000  103803.250000     29.000000   185.000000    84.000000
max     2016.000000  135553.000000     64.000000   223.000000   170.000000